assignment/assignment-11/Client/src/main/resource/log.txt

=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="0"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="0"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>beijia@nju.edu.cn</email><pwd>123456</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Response============
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><modifyScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>100</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></modifyScore></soap:Body></soap:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>beijia@nju.edu.cn</email><pwd>123456</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Response============
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><modifyScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></modifyScore></soap:Body></soap:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header/><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
=============Request=============
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><S:Header><email>141250019@smail.nju.edu.cn</email><pwd>141250019</pwd></S:Header><S:Body><addScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></addScore></S:Body></S:Envelope>
ÄãµÄÈ¨ÏŞ²»ÄÜ½øĞĞ´ËÏî²Ù×÷
=============Response============
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><soap:Body><modifyScore xmlns="http://jw.nju.edu.cn/schema"><è¯¾ç¨‹æˆç»©åˆ—è¡¨><è¯¾ç¨‹æˆç»© æˆç»©æ€§è´¨="æ€»è¯„æˆç»©" è¯¾ç¨‹ç¼–å·="4"><æˆç»©><å­¦å·>141250019</å­¦å·><å¾—åˆ†>0</å¾—åˆ†></æˆç»©></è¯¾ç¨‹æˆç»©></è¯¾ç¨‹æˆç»©åˆ—è¡¨></modifyScore></soap:Body></soap:Envelope>
